app/Http/Controllers/Auth/TwitterController.php

    private function findOrCreateUser($twitterUser)
    {
        $authUser = User::where('twitter_id', $twitterUser->id)->first();
---
select * from `users` where `twitter_id` = '1048190671885033475' limit 1