app/Http/Controllers/User/MovieController.php

select * from `movie_data`
---
    public function index(Request $request)
    {
        $cond_title = $request->cond_title;
        if ($cond_title != null) {
            $posts = MovieData::whereRaw('title LIKE ?', "%" . $cond_title . "%")->get();
        } else {
            $posts = MovieData::all();

select * from `review_data`
---
    public function status(Request $request)
    {
        $movies = MovieData::find($request->id);

        $cond_title = $request->cond_title;
        if ($cond_title != '') {
            $posts = ReviewData::whereRaw('title LIKE ?', "%" . $cond_title . "%")->get();
        } else {
            $posts = ReviewData::all();