app/Http/Controllers/User/ReviewController.php

select * from `review_data`
---
  public function index(Request $request)
  {
    $cond_title = $request->cond_title;
    if ($cond_title != '') {
      $posts = ReviewData::where('title', $cond_title)->get();
    } else {
      $posts = ReviewData::all();