app/Http/Controllers/User/UserController.php

select * from `review_data`
select * from `review_data` where `review_data`.`user_id` = 5 and `review_data`.`user_id` is not null
---
    public function index(Request $request)
    {
        // 自分の投稿一覧画面
        $cond_title = $request->cond_title;
        if ($cond_title != '') {
            $posts = ReviewData::where('title', $cond_title)->get();
        } else {
            $posts = ReviewData::all();
        }
        // $user = User::find('id');
        // \Debugbar::info($posts);
        $user_id = Auth::user()->id;
        $posts = User::find($user_id)->reviews;