app/Http/Controllers/Admin/MovieController.php

    public function create(Request $request)
    {
        $this->validate($request, MovieData::$rules);

        $movies = new MovieData;
        $form = $request->all();
        if (isset($form['image'])) {
            $path = Storage::disk('s3')->putFile('/', $form['image'], 'public');
            $movies->image_path = Storage::disk('s3')->url($path);
        } else {
            $movies->image_path = null;
        }
        unset($form['_token']);
        unset($form['image']);

        $movies->fill($form);
        $movies->save();
---
insert into `movie_data` (`image_path`, `title`, `japanese`, `director`, `actor`, `description`, `year`, `type`, `country`, `updated_at`, `created_at`) values ('V2dISIpjPkz9jXHEssPwMvzwbEDhKh6MYTHQYzpd.jpeg', 'ハリー・ポッターと死の秘宝 PART2', 'ハリー・ポッターと死の秘宝 PART2', 'デビッド・イェーツ', 'ダニエル・ラドクリフ　ルパート・グリント　エマ・ワトソン', 'J・K・ローリングによる世界的ベストセラーシリーズを映画化した最終章2部作の完結編。魔法省やホグワーツ魔法魔術学校までもが死喰い人の支配下に落ちる中、ハリー、ロン、ハーマイオニーは、ヴォルデモート打倒のカギを握る「分霊箱」を見つけ出す旅を続けていた。しかし、その間にもヴォルデモートは着実に力を蓄えていき……。監督はシリーズ第5作「不死鳥の騎士団」からメガホンをとるデビッド・イェーツ。', '2011', 'ファンタジー', 'アメリカ', '2020-03-19 10:19:15', '2020-03-19 10:19:15')

    public function index(Request $request)
    {
        $cond_title = $request->cond_title;
        if ($cond_title != '') {
            $movies = MovieData::whereRaw('title LIKE ?', "%" . $cond_title . "%")->get();
        } else {
            $movies = MovieData::all()->sortByDesc('updated_at');
---
select * from `movie_data`