app/Http/Controllers/Guest/MovieController.php

select * from `movie_data`
---
    public function index(Request $request)
    {
        $cond_title = $request->cond_title;
        if ($cond_title != null) {
            $movies = MovieData::whereRaw('title LIKE ?', "%" . $cond_title . "%")->get();
        } else {
            $movies = MovieData::all()->sortByDesc('updated_at');

select * from `review_data`
---
    public function status(Request $request)
    {
        $movie = MovieData::find($request->id);
        $reviews = ReviewData::all();