app/Http/Controllers/Guest/ReviewController.php

    public function index(Request $request)
    {
        $cond_title = $request->cond_title;
        $reviews = null;
        if ($cond_title != '') {
            $reviews = ReviewData::whereRaw('title LIKE ?', "%" . $cond_title . "%")->get();
        } else {
            $reviews = ReviewData::all();
---
select * from `review_data`